ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_flashc_v2.h
/***************************************************************************//**
* \file cyip_flashc_v2.h
*
* \brief
* FLASHC IP definitions
*
* \note
* Generator version: 1.5.0.1274
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_FLASHC_V2_H_
#define _CYIP_FLASHC_V2_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    FLASHC
*******************************************************************************/

#define FLASHC_FM_CTL_V2_SECTION_SIZE           0x00001000UL
#define FLASHC_V2_SECTION_SIZE                  0x00010000UL

/**
  * \brief Flash Macro Registers (FLASHC_FM_CTL)
  */
typedef struct {
  __IOM uint32_t FM_CTL;                        /*!< 0x00000000 Flash macro control */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status */
  __IOM uint32_t FM_ADDR;                       /*!< 0x00000008 Flash macro address */
  __IOM uint32_t BOOKMARK;                      /*!< 0x0000000C Bookmark register - keeps the current FW HV seq */
   __IM uint32_t GEOMETRY;                      /*!< 0x00000010 Regular flash geometry */
   __IM uint32_t GEOMETRY_SUPERVISORY;          /*!< 0x00000014 Supervisory flash geometry */
  __IOM uint32_t ANA_CTL0;                      /*!< 0x00000018 Analog control 0 */
  __IOM uint32_t ANA_CTL1;                      /*!< 0x0000001C Analog control 1 */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t WAIT_CTL;                      /*!< 0x00000028 Wait State control */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t TIMER_CLK_CTL;                 /*!< 0x00000034 Timer prescaler (clk_t to timer clock frequency divider) */
  __IOM uint32_t TIMER_CTL;                     /*!< 0x00000038 Timer control */
   __OM uint32_t ACLK_CTL;                      /*!< 0x0000003C MPCON clock */
  __IOM uint32_t INTR;                          /*!< 0x00000040 Interrupt */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000044 Interrupt set */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000048 Interrupt mask */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000004C Interrupt masked */
  __IOM uint32_t CAL_CTL0;                      /*!< 0x00000050 Cal control BG LO trim bits */
  __IOM uint32_t CAL_CTL1;                      /*!< 0x00000054 Cal control BG HI trim bits */
  __IOM uint32_t CAL_CTL2;                      /*!< 0x00000058 Cal control BG LO&HI trim bits */
  __IOM uint32_t CAL_CTL3;                      /*!< 0x0000005C Cal control osc trim bits, idac, sdac, itim */
  __IOM uint32_t CAL_CTL4;                      /*!< 0x00000060 Cal Control Vlim, SA, fdiv, reg_act */
  __IOM uint32_t CAL_CTL5;                      /*!< 0x00000064 Cal control */
  __IOM uint32_t CAL_CTL6;                      /*!< 0x00000068 SA trim LP/ULP */
  __IOM uint32_t CAL_CTL7;                      /*!< 0x0000006C Cal control */
   __IM uint32_t RESERVED2[4];
  __IOM uint32_t RED_CTL01;                     /*!< 0x00000080 Redundancy Control normal sectors 0,1 */
  __IOM uint32_t RED_CTL23;                     /*!< 0x00000084 Redundancy Control normal sectors 2,3 */
  __IOM uint32_t RED_CTL45;                     /*!< 0x00000088 Redundancy Control normal sectors 4,5 */
  __IOM uint32_t RED_CTL67;                     /*!< 0x0000008C Redundancy Control normal sectors 6,7 */
  __IOM uint32_t RED_CTL_SM01;                  /*!< 0x00000090 Redundancy Control special sectors 0,1 */
   __IM uint32_t RESERVED3;
  __IOM uint32_t RGRANT_DELAY_PRG;              /*!< 0x00000098 R-grant delay for program */
   __IM uint32_t RESERVED4;
  __IOM uint32_t PW_SEQ12;                      /*!< 0x000000A0 HV Pulse Delay for seq 1&2 pre */
  __IOM uint32_t PW_SEQ23;                      /*!< 0x000000A4 HV Pulse Delay for seq2 post & seq3 */
  __IOM uint32_t RGRANT_SCALE_ERS;              /*!< 0x000000A8 R-grant delay scale for erase */
  __IOM uint32_t RGRANT_DELAY_ERS;              /*!< 0x000000AC R-grant delay for erase */
   __IM uint32_t RESERVED5[467];
  __IOM uint32_t FM_PL_WRDATA_ALL;              /*!< 0x000007FC Flash macro write page latches all */
  __IOM uint32_t FM_PL_DATA[256];               /*!< 0x00000800 Flash macro Page Latches data */
   __IM uint32_t FM_MEM_DATA[256];              /*!< 0x00000C00 Flash macro memory sense amplifier and column decoder data */
} FLASHC_FM_CTL_V2_Type;                        /*!< Size = 4096 (0x1000) */

/**
  * \brief Flash controller (FLASHC)
  */
typedef struct {
  __IOM uint32_t FLASH_CTL;                     /*!< 0x00000000 Control */
  __IOM uint32_t FLASH_PWR_CTL;                 /*!< 0x00000004 Flash power control */
  __IOM uint32_t FLASH_CMD;                     /*!< 0x00000008 Command */
   __IM uint32_t RESERVED[165];
  __IOM uint32_t ECC_CTL;                       /*!< 0x000002A0 ECC control */
   __IM uint32_t RESERVED1[3];
  __IOM uint32_t FM_SRAM_ECC_CTL0;              /*!< 0x000002B0 eCT Flash SRAM ECC control 0 */
  __IOM uint32_t FM_SRAM_ECC_CTL1;              /*!< 0x000002B4 eCT Flash SRAM ECC control 1 */
   __IM uint32_t FM_SRAM_ECC_CTL2;              /*!< 0x000002B8 eCT Flash SRAM ECC control 2 */
  __IOM uint32_t FM_SRAM_ECC_CTL3;              /*!< 0x000002BC eCT Flash SRAM ECC control 3 */
   __IM uint32_t RESERVED2[80];
  __IOM uint32_t CM0_CA_CTL0;                   /*!< 0x00000400 CM0+ cache control */
  __IOM uint32_t CM0_CA_CTL1;                   /*!< 0x00000404 CM0+ cache control */
  __IOM uint32_t CM0_CA_CTL2;                   /*!< 0x00000408 CM0+ cache control */
   __IM uint32_t RESERVED3[13];
   __IM uint32_t CM0_CA_STATUS0;                /*!< 0x00000440 CM0+ cache status 0 */
   __IM uint32_t CM0_CA_STATUS1;                /*!< 0x00000444 CM0+ cache status 1 */
   __IM uint32_t CM0_CA_STATUS2;                /*!< 0x00000448 CM0+ cache status 2 */
   __IM uint32_t RESERVED4[5];
  __IOM uint32_t CM0_STATUS;                    /*!< 0x00000460 CM0+ interface status */
   __IM uint32_t RESERVED5[7];
  __IOM uint32_t CM4_CA_CTL0;                   /*!< 0x00000480 CM4 cache control */
  __IOM uint32_t CM4_CA_CTL1;                   /*!< 0x00000484 CM4 cache control */
  __IOM uint32_t CM4_CA_CTL2;                   /*!< 0x00000488 CM4 cache control */
   __IM uint32_t RESERVED6[13];
   __IM uint32_t CM4_CA_STATUS0;                /*!< 0x000004C0 CM4 cache status 0 */
   __IM uint32_t CM4_CA_STATUS1;                /*!< 0x000004C4 CM4 cache status 1 */
   __IM uint32_t CM4_CA_STATUS2;                /*!< 0x000004C8 CM4 cache status 2 */
   __IM uint32_t RESERVED7[5];
  __IOM uint32_t CM4_STATUS;                    /*!< 0x000004E0 CM4 interface status */
   __IM uint32_t RESERVED8[7];
  __IOM uint32_t CRYPTO_BUFF_CTL;               /*!< 0x00000500 Cryptography buffer control */
   __IM uint32_t RESERVED9[31];
  __IOM uint32_t DW0_BUFF_CTL;                  /*!< 0x00000580 Datawire 0 buffer control */
   __IM uint32_t RESERVED10[31];
  __IOM uint32_t DW1_BUFF_CTL;                  /*!< 0x00000600 Datawire 1 buffer control */
   __IM uint32_t RESERVED11[31];
  __IOM uint32_t DMAC_BUFF_CTL;                 /*!< 0x00000680 DMA controller buffer control */
   __IM uint32_t RESERVED12[31];
  __IOM uint32_t EXT_MS0_BUFF_CTL;              /*!< 0x00000700 External master 0 buffer control */
   __IM uint32_t RESERVED13[31];
  __IOM uint32_t EXT_MS1_BUFF_CTL;              /*!< 0x00000780 External master 1 buffer control */
   __IM uint32_t RESERVED14[14879];
        FLASHC_FM_CTL_V2_Type FM_CTL;           /*!< 0x0000F000 Flash Macro Registers */
} FLASHC_V2_Type;                               /*!< Size = 65536 (0x10000) */


